#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/naga-paritala/terraform-samples/runs/run-kSXaXdEKsipbQTNA

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
2020/12/14 19:04:19 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 19:04:19 [INFO] Terraform version: 0.14.0  
2020/12/14 19:04:19 [INFO] Go runtime version: go1.15.2
2020/12/14 19:04:19 [INFO] CLI args: []string{"/usr/local/bin/terraform", "plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 19:04:19 Loading CLI configuration from /tmp/cli.tfrc
2020/12/14 19:04:19 [INFO] CLI command args: []string{"plan", "-out", "/terraform/terraform.tfplan", "-detailed-exitcode", "-var-file=/terraform/terraform.tfvars", "-lock=false", "-parallelism=10"}
2020/12/14 19:04:19 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/12/14 19:04:20 [INFO] Failed to read plugin lock file .terraform/plugins/linux_amd64/lock.json: open .terraform/plugins/linux_amd64/lock.json: no such file or directory
2020/12/14 19:04:20 [INFO] backend/local: starting Plan operation
2020-12-14T19:04:21.357Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:04:21.439Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:04:21.439Z
2020-12-14T19:04:21.747Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T19:04:21.748Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:04:21.797Z [INFO]  plugin.terraform-provider-null_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:04:21.797Z
2020-12-14T19:04:21.920Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020-12-14T19:04:21.921Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:04:21.966Z [INFO]  plugin.terraform-provider-random_v3.0.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:04:21.966Z
2020-12-14T19:04:22.098Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 19:04:22 [INFO] terraform: building graph: GraphTypeValidate
2020-12-14T19:04:22.111Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:04:22.198Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:04:22.197Z
2020-12-14T19:04:22.630Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/12/14 19:04:22 [INFO] backend/local: plan calling Plan
2020/12/14 19:04:22 [INFO] terraform: building graph: GraphTypePlan
2020-12-14T19:04:22.643Z [INFO]  plugin: configuring client automatic mTLS
2020-12-14T19:04:22.730Z [INFO]  plugin.terraform-provider-aws_v3.21.0_x5: configuring server automatic mTLS: timestamp=2020-12-14T19:04:22.729Z
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "var.cidr_block"
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .max_session_duration: planned value cty.NumberIntVal(3600) does not match config value cty.NullVal(cty.Number)
      - .path: planned value cty.StringVal("/") does not match config value cty.NullVal(cty.String)
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_vpc.main_vpc, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_generated_ipv6_cidr_block: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .enable_dns_support: planned value cty.True does not match config value cty.NullVal(cty.Bool)
      - .instance_tenancy: planned value cty.StringVal("default") does not match config value cty.NullVal(cty.String)
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.public_fe, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_be, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .map_public_ip_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private_db, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .assign_ipv6_address_on_creation: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .map_public_ip_on_launch: planned value cty.False does not match config value cty.NullVal(cty.Bool)
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_internet_gateway.main_internet_gateway"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:04:23 [INFO] ReferenceTransformer: reference not found: "var.subnet_fe_id"
2020/12/14 19:04:23 [WARN] Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.eks_cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kubernetes_network_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .vpc_config[0].subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
      - .vpc_config[0].endpoint_private_access: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .vpc_config[0].endpoint_public_access: planned value cty.True does not match config value cty.NullVal(cty.Bool)
2020-12-14T19:04:23.489Z [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Canceled desc = context canceled"
2020/12/14 19:04:23 [INFO] backend/local: plan operation completed
2020/12/14 19:04:23 [INFO] backend/local: writing plan output to: /terraform/terraform.tfplan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks_cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_role-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_role-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

  # module.vpc.aws_eip.nat_be will be created
  + resource "aws_eip" "nat_be" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat_db will be created
  + resource "aws_eip" "nat_db" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.main_internet_gateway will be created
  + resource "aws_internet_gateway" "main_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_be will be created
  + resource "aws_nat_gateway" "nat_gw_be" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw_db will be created
  + resource "aws_nat_gateway" "nat_gw_db" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
    }

  # module.vpc.aws_subnet.private_be will be created
  + resource "aws_subnet" "private_be" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.100.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private_db will be created
  + resource "aws_subnet" "private_db" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.200.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Private"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public_fe will be created
  + resource "aws_subnet" "public_fe" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "Public"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.main_vpc will be created
  + resource "aws_vpc" "main_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks_role_arn = (known after apply)
  + vpc_id       = (known after apply)
```
</details>
*Pusher: @malliparitala, Action: `pull_request`*